Repository: IIA-GF2-Matts/GF2-SoftEngProj
Catalog: intl/*/mattlang.po
Languages: de

source: high
de: hoch

source: low
de: niedrig

source: rising
de: steigend

source: falling
de: rückläufig

source: floating
de: schwimmend

source: Device
de: Ding

source: Kind
de: Sorte

source: Inputs
de: Eingänge

source: Outputs
de: Ausgänge

source: Error creating imported device in network.
de: Fehler importierte Ding in Netzwerk zu schaffen

source: Start of execution cycle
de: Beginn der Ausführungszyklus

source: machine cycle
de: Maschinenzyklus

source: End of execution cycle
de: Ende der Ausführungszyklus

source: In imported devices, monitors using pin names are ignored.
de: In importierten Dinge, Monitore Pin-Namen verwendet werden ignoriert.

source: No outputs defined for imported device.
de: Keine Ausgaben für importierte Ding definiert.

source: Unable to open file for importing.
de: Datei kann nicht geöffnet für den Import.

source: Imported device network failed to stabilise.
de: Datei kann nicht geöffnet für den Import.

source: Input {0}.InitialValue has not been assigned a value.
de: Eingang {0}.InitialWert kein Wert zugewiesen wurde.

source: Input {0}.Period has not been assigned a value.
de: Eingang {0}.Period kein Wert zugewiesen wurde.

source: Input {0} has not been assigned a value.
de: Eingang {0} wurde kein Wert zugewiesen.

source: Input {0}.{1} has not been assigned a value.
de: Eingang {0}.{1} wurde kein Wert zugewiesen.

source: {0} (of type {1}) has no default output pin.
de: {0} (vom Typ {1}) hat keine Standard-Output-Pin.

source: {0} (of type {1}) has no output pin {2}.
de: {0} (vom Typ {1}) hat keine Ausgangs-Pin {2}.

source: Use Q or Qbar.
de: Verwenden Sie Q oder Qbar.

source: Attempt to redefine {0}.{1}.
de: Versuch, neu zu definieren {0}. {1}.

source: Previously defined as {0} here.
de: Früher definiert als {0} hier.

source: Repeated definition of the same device.
de: Definition des gleichen Dingen wiederholte.

source: Device types may not be assigned to devices that already exist.
de: Dingtypen können nicht auf Dingen zugewiesen werden, die bereits vorhanden sind.

source: Previously defined here.
de: Früher hier festgelegt.

source: Unable to add device to the network.
de: Kann nicht Ding mit dem Netzwerk hinzuzufügen.

source: Switches may only have an InitialValue attribute.
de: Schalter kann nur eine Initial Attribut haben.

source: Clocks may only have a Period attribute.
de: Clocks kann nur ein Zeitraum Attribut haben.

source: Signal generators may only have SIG or Period attributes.
de: Signalgeneratoren kann nur SIG oder Period Attribute.

source: AND gates may only have input pin attributes (up to 16), labelled I1 to I16
de: AND-Gatter kann nur Eingangs-Pin Attribute haben (bis zu 16), beschriftet I1 bis I16

source: NAND gates may only have input pin attributes (up to 16), labelled I1 to I16
de: NAND-Gatter kann nur Eingangs-Pin Attribute haben (bis zu 16), beschriftet I1 bis I16

source: OR gates may only have input pin attributes (up to 16), labelled I1 to I16
de: OR-Gatter kann nur Eingangs-Pin Attribute haben (bis zu 16), beschriftet I1 bis I16

source: NOR gates may only have input pin attributes (up to 16), labelled I1 to I16
de: NOR-Gatter kann nur Eingangs-Pin Attribute haben (bis zu 16), beschriftet I1 bis I16

source: XOR gates may only have input pin attributes (up to 2), labelled I1 to I2
de: XOR-Gatter kann nur Eingangs-Pin Attribute haben (bis zu 2), beschriftet mit I1 bis I2

source: DTYPE devices may only have DATA, CLK, SET or CLEAR input pins assigned.
de: DTYPE Dinge dürfen nur haben DATA, CLK, SET oder CLEAR Eingangs-Pins zugewiesen.

source: Imported device {0} has no input pin {1}.
de: Importierte Ding {0} hat keinen Eingabestift {1}.

source: SELECT device {0} has no input pin {1}. Correct pins are SW, HIGH and LOW.
de: SELECT Ding {0} hat keine Eingabestift {1}. Die korrekte Pins sind SW, hoch und niedrig.

source: Could not assign option to an unknown device type
de: Konnte keine Option auf einen unbekannten Dingtyp zuordnen

source: Previously defined as a bitstream here.
de: Früher als Bitstrom hier festgelegt.

source: Device with requested output pin could not be found in the network. Connection not made.
de: Ding mit angeforderten Ausgangspin konnte nicht im Netzwerk gefunden werden.Verbindung nicht gemacht.

source: Previously defined as {0}.{1} here.
de: Früher definiert als {0}. {1} hier.

source: Invalid signal name: input pins should be assigned a valid signal name or a logical state (0 or 1)
de: Ungültige Signalname: Eingangs-Pins sollte ein gültiges Signal Name oder ein zugewiesen werdenLogischen Zustand (0 oder 1)

source: Clock periods must be numeric (assigning an identifier was attempted)
de: Taktperioden muss numerisch sein (die Zuweisung einer Kennung versucht wurde)

source: Initial values may only be 0 or 1, assigning a signal is not supported.
de: Anfangswerte können nur 0 oder 1 sein, die Zuordnung ein Signal nicht unterstützt wird.

source: Attempt to assign an identifier to a property
de: Versuch, eine Kennung zu einer Eigenschaft zuweisen

source: Devices must be defined before being referenced
de: Dinge müssen vor dem referenzierten definiert werden

source: Unable to set input pin. {0}
de: Kann nicht Eingangs-Pin eingestellt werden. {0}

source: Could not make connection. One of the signals could not be found.
de: Verbindung konnte nicht machen. Eines der Signale konnte nicht gefunden werden.

source: Switches must have initial values of either 0 or 1
de: Switches müssen Anfangswerte von 0 oder 1

source: Could not set switch initial value
de: Konnte nicht gesetzt Anfangswert schalten

source: Clock periods must be integers between {0} and {1}.
de: Taktperioden müssen ganze Zahlen zwischen {0} und {1}.

source: Could not set clock period
de: Es konnte keine Taktperiode gesetzt

source: Signal generator periods must be integers between {0} and {1}.
de: Signalgenerator Perioden müssen ganze Zahlen zwischen {0} und {1}.

source: Signal generator SIG inputs must be bitstreams longer than zero bits
de: Signalgenerator SIG-Eingänge müssen bitstreams länger sein als Null-Bits

source: Devices must be defined before being monitored
de: Dinge müssen vor dem überwacht definiert werden

source: Unable to set monitor point. {0}
de: Kann nicht Monitorpunkt gesetzt. {0}

source: Signal is already being monitored.
de: Signal wird bereits überwacht wird.

source: The 'as {0}' is not required in this case.
de: Der 'als {0}' in diesem Fall nicht erforderlich ist.

source: The 'as {0}.{1}' is not required in this case.
de: Der 'als {0}. {1}' in diesem Fall nicht erforderlich ist.

source: Alias signal name already exists as a device output in the network
de: Alias ​​Signalname existiert bereits als Dingausgang im Netz

source: Alias name already exists, monitoring a different signal
de: Alias ​​Name bereits vorhanden ist, ein anderes Signal Monitoring

source: Could not make monitor. All available monitors are used, or the device output could not be found.
de: Konnte nicht-Monitor machen. Alle verfügbaren Monitore verwendet werden, oder das DingAusgang konnte nicht gefunden werden.

source: File parsed with {0} errors and {1} warnings.
de: Datei analysiert mit {0} Fehler und {1} Warnungen.

source: Unable to read import file.
de: Kann nicht Import-Datei zu lesen.

source: Expected a device name.
de: einen Dingnamen erwartet.

source: Expected a device type.
de: einen Dingtyp erwartet.

source: Expected a device type such as CLOCK, SWITCH, NAND or others (see documentation).
de: Erwartet einen Dingtyp wie CLOCK, SWITCH, NAND oder andere (sieheDokumentation).

source: Unexpected token. Expecting ; (if the end of the statement), or { (if beginning an option block).
de: Unerwartetes Token Erwartung;. (Wenn das Ende der Anweisung) oder {(fallsBeginnen Sie eine Option Block).

source: Unterminated braces.
de: Nicht abgebrochene Klammern.

source: Expected a key.
de: Erwartete einen Schlüssel.

source: Expected colon.
de: Erwartete Doppelpunkt.

source: Missing a semicolon on the end.
de: Fehlt ein Semikolon am Ende.

source: Expected an Identifier or Number
de: Erwartete eine Kennung oder Nummer

source: Expected a comma in the monitor list.
de: ein Komma in der Monitorliste erwartet.

source: Expected a signal name.
de: einen Signalnamen erwartet.

source: Expected a pin name.
de: Erwartete einen Namen Pin.

source: Unterminated block comment.
de: Unterminated Block Kommentar.

source: Illegal character sequence '/' in file.
de: Illegal Zeichenfolge '/' in der Datei.

source: Number is too large to be represented in Mattlab.
de: Nummer zu groß ist in Mattlab vertreten zu sein.

source: Illegal Character '{0}' in file.
de: Unzulässige Zeichen '{0}' in der Datei.

source: Null byte in file. Note only ISO 8859 encoding is accepted
de: Null-Byte in der Datei. Beachten Sie nur ISO 8859-Codierung wird angenommen

source: Illegal non-printing character, code {0} in file.
de: Illegal Nicht-Druck-Zeichen, Code {0} in der Datei.

source: Unterminated string.
de: Nicht abgebrochene Zeichenfolge.

source: Was expecting a binary digit, empty bitstreams not allowed.
de: erwartete ein binary digit, leere bitstreams nicht erlaubt.
