Repository: IIA-GF2-Matts/GF2-SoftEngProj
Catalog: */mattlab.po
Languages: de

source: &Open Ctrl+O
de: Öffnen Ctrl+O

source: Monitor Signal List
de: Liste der Monitorsignale

source: &About
de: &Über

source: Cool Blue
de: Kühles Blau

source: Retro Green
de: Retro-grün

source: Simple B+W
de: Einfache Schwarz-Weiß

source: Candy Pink
de: Süße Rosa

source: Colour Theme
de: Farbthema

source: &Zoom in Ctrl+=
de: Hineinzoomen

source: &Zoom out Ctrl+-
de: Rauszoomen Ctrl+=

source: &Reset zoom Ctrl+0
de: Zoom zurücksetzen Ctrl+0

source: &File
de: Datei

source: &View
de: Blick

source: Run
de: Laufen

source: Continue
de: Fortsetzen

source: Cycles:
de: Zyklen:

source: Run controls
de: Laufen Kontrolen

source: Switches
de: Schalter

source: Monitors
de: Monitore

source: Open Mattlab file
de: Öffne Mattlab Datei

source: Mattlab Digital Logic Simulator Produced for Engineering IIA project GF2 2016 by: Matt March (mdm46) Matt Judge (mcj33) Matt Diesel (md639)
de: Mattlab Digitale Logiksimulator für das Engineering IIA Projekt GF2 ProduziertMatt March (mdm46) Matt Judge (mcj33) Matt Diesel (md639)

source: About Mattlab
de: Über Mattlab

source: No monitors selected for simulator. Select or add a monitor to view output.
de: Keine Monitore für Simulator Ausgewählt Wählen oder einen Monitor Hinzufügen Ausgabe Anzuzeigen

source: Select 'file' -> 'open' to begin...
de: Aussuchen 'Datei' -> 'Öffnen' zu beginnen

source: Welcome to MattLab Logic Simulator
de: Willkommen zu Mattlab Logiksimulator

source: Add/Remove Monitors
de: Hinzufügen/Entfernen von Monitoren

source: ERROR! YOU IDIOT!
de: Ach Nein! Es ist kaput!

source: There were
de: Es gab

source: errors and
de: Fehler und

source: warnings processing the input file.
de: Warnungen, die Verarbeitung der Engabedatei.
